tutorials/verificationAndValidation/interCondensatingEvaporatingFoam/stefanProblem/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
restore0Dir
cp -r 0 1.36
runApplication setAlphaField

runApplication $(getApplication)

./plotGraph

#------------------------------------------------------------------------------
